__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            (None, None, None, 1 0                                            
__________________________________________________________________________________________________
conv2d_43 (Conv2D)              (None, None, None, 3 64          input_2[0][0]                    
__________________________________________________________________________________________________
conv2d_44 (Conv2D)              (None, None, None, 6 640         input_2[0][0]                    
__________________________________________________________________________________________________
conv2d_45 (Conv2D)              (None, None, None, 3 832         input_2[0][0]                    
__________________________________________________________________________________________________
activation_41 (Activation)      (None, None, None, 3 0           conv2d_43[0][0]                  
__________________________________________________________________________________________________
activation_42 (Activation)      (None, None, None, 6 0           conv2d_44[0][0]                  
__________________________________________________________________________________________________
activation_43 (Activation)      (None, None, None, 3 0           conv2d_45[0][0]                  
__________________________________________________________________________________________________
concatenate_11 (Concatenate)    (None, None, None, 1 0           activation_41[0][0]              
                                                                 activation_42[0][0]              
                                                                 activation_43[0][0]              
__________________________________________________________________________________________________
conv2d_46 (Conv2D)              (None, None, None, 6 8256        concatenate_11[0][0]             
__________________________________________________________________________________________________
activation_44 (Activation)      (None, None, None, 6 0           conv2d_46[0][0]                  
__________________________________________________________________________________________________
conv2d_47 (Conv2D)              (None, None, None, 3 2080        activation_44[0][0]              
__________________________________________________________________________________________________
conv2d_48 (Conv2D)              (None, None, None, 6 36928       activation_44[0][0]              
__________________________________________________________________________________________________
conv2d_49 (Conv2D)              (None, None, None, 3 51232       activation_44[0][0]              
__________________________________________________________________________________________________
activation_45 (Activation)      (None, None, None, 3 0           conv2d_47[0][0]                  
__________________________________________________________________________________________________
activation_46 (Activation)      (None, None, None, 6 0           conv2d_48[0][0]                  
__________________________________________________________________________________________________
activation_47 (Activation)      (None, None, None, 3 0           conv2d_49[0][0]                  
__________________________________________________________________________________________________
concatenate_12 (Concatenate)    (None, None, None, 1 0           activation_45[0][0]              
                                                                 activation_46[0][0]              
                                                                 activation_47[0][0]              
__________________________________________________________________________________________________
conv2d_50 (Conv2D)              (None, None, None, 6 8256        concatenate_12[0][0]             
__________________________________________________________________________________________________
activation_48 (Activation)      (None, None, None, 6 0           conv2d_50[0][0]                  
__________________________________________________________________________________________________
conv2d_51 (Conv2D)              (None, None, None, 3 2080        activation_48[0][0]              
__________________________________________________________________________________________________
conv2d_52 (Conv2D)              (None, None, None, 6 36928       activation_48[0][0]              
__________________________________________________________________________________________________
conv2d_53 (Conv2D)              (None, None, None, 3 51232       activation_48[0][0]              
__________________________________________________________________________________________________
activation_49 (Activation)      (None, None, None, 3 0           conv2d_51[0][0]                  
__________________________________________________________________________________________________
activation_50 (Activation)      (None, None, None, 6 0           conv2d_52[0][0]                  
__________________________________________________________________________________________________
activation_51 (Activation)      (None, None, None, 3 0           conv2d_53[0][0]                  
__________________________________________________________________________________________________
concatenate_13 (Concatenate)    (None, None, None, 1 0           activation_49[0][0]              
                                                                 activation_50[0][0]              
                                                                 activation_51[0][0]              
__________________________________________________________________________________________________
conv2d_54 (Conv2D)              (None, None, None, 6 8256        concatenate_13[0][0]             
__________________________________________________________________________________________________
activation_52 (Activation)      (None, None, None, 6 0           conv2d_54[0][0]                  
__________________________________________________________________________________________________
conv2d_55 (Conv2D)              (None, None, None, 3 2080        activation_52[0][0]              
__________________________________________________________________________________________________
conv2d_56 (Conv2D)              (None, None, None, 6 36928       activation_52[0][0]              
__________________________________________________________________________________________________
conv2d_57 (Conv2D)              (None, None, None, 3 51232       activation_52[0][0]              
__________________________________________________________________________________________________
activation_53 (Activation)      (None, None, None, 3 0           conv2d_55[0][0]                  
__________________________________________________________________________________________________
activation_54 (Activation)      (None, None, None, 6 0           conv2d_56[0][0]                  
__________________________________________________________________________________________________
activation_55 (Activation)      (None, None, None, 3 0           conv2d_57[0][0]                  
__________________________________________________________________________________________________
concatenate_14 (Concatenate)    (None, None, None, 1 0           activation_53[0][0]              
                                                                 activation_54[0][0]              
                                                                 activation_55[0][0]              
__________________________________________________________________________________________________
conv2d_58 (Conv2D)              (None, None, None, 6 8256        concatenate_14[0][0]             
__________________________________________________________________________________________________
activation_56 (Activation)      (None, None, None, 6 0           conv2d_58[0][0]                  
__________________________________________________________________________________________________
conv2d_59 (Conv2D)              (None, None, None, 3 2080        activation_56[0][0]              
__________________________________________________________________________________________________
conv2d_60 (Conv2D)              (None, None, None, 6 36928       activation_56[0][0]              
__________________________________________________________________________________________________
conv2d_61 (Conv2D)              (None, None, None, 3 51232       activation_56[0][0]              
__________________________________________________________________________________________________
activation_57 (Activation)      (None, None, None, 3 0           conv2d_59[0][0]                  
__________________________________________________________________________________________________
activation_58 (Activation)      (None, None, None, 6 0           conv2d_60[0][0]                  
__________________________________________________________________________________________________
activation_59 (Activation)      (None, None, None, 3 0           conv2d_61[0][0]                  
__________________________________________________________________________________________________
concatenate_15 (Concatenate)    (None, None, None, 1 0           activation_57[0][0]              
                                                                 activation_58[0][0]              
                                                                 activation_59[0][0]              
__________________________________________________________________________________________________
conv2d_62 (Conv2D)              (None, None, None, 6 8256        concatenate_15[0][0]             
__________________________________________________________________________________________________
activation_60 (Activation)      (None, None, None, 6 0           conv2d_62[0][0]                  
__________________________________________________________________________________________________
conv2d_63 (Conv2D)              (None, None, None, 1 65          activation_60[0][0]              
__________________________________________________________________________________________________
subtract_2 (Subtract)           (None, None, None, 1 0           input_2[0][0]                    
                                                                 conv2d_63[0][0]                  
__________________________________________________________________________________________________
conv2d_64 (Conv2D)              (None, None, None, 3 64          subtract_2[0][0]                 
__________________________________________________________________________________________________
conv2d_65 (Conv2D)              (None, None, None, 6 640         subtract_2[0][0]                 
__________________________________________________________________________________________________
conv2d_66 (Conv2D)              (None, None, None, 3 832         subtract_2[0][0]                 
__________________________________________________________________________________________________
activation_61 (Activation)      (None, None, None, 3 0           conv2d_64[0][0]                  
__________________________________________________________________________________________________
activation_62 (Activation)      (None, None, None, 6 0           conv2d_65[0][0]                  
__________________________________________________________________________________________________
activation_63 (Activation)      (None, None, None, 3 0           conv2d_66[0][0]                  
__________________________________________________________________________________________________
concatenate_16 (Concatenate)    (None, None, None, 1 0           activation_61[0][0]              
                                                                 activation_62[0][0]              
                                                                 activation_63[0][0]              
__________________________________________________________________________________________________
conv2d_67 (Conv2D)              (None, None, None, 6 8256        concatenate_16[0][0]             
__________________________________________________________________________________________________
activation_64 (Activation)      (None, None, None, 6 0           conv2d_67[0][0]                  
__________________________________________________________________________________________________
conv2d_68 (Conv2D)              (None, None, None, 3 2080        activation_64[0][0]              
__________________________________________________________________________________________________
conv2d_69 (Conv2D)              (None, None, None, 6 36928       activation_64[0][0]              
__________________________________________________________________________________________________
conv2d_70 (Conv2D)              (None, None, None, 3 51232       activation_64[0][0]              
__________________________________________________________________________________________________
activation_65 (Activation)      (None, None, None, 3 0           conv2d_68[0][0]                  
__________________________________________________________________________________________________
activation_66 (Activation)      (None, None, None, 6 0           conv2d_69[0][0]                  
__________________________________________________________________________________________________
activation_67 (Activation)      (None, None, None, 3 0           conv2d_70[0][0]                  
__________________________________________________________________________________________________
concatenate_17 (Concatenate)    (None, None, None, 1 0           activation_65[0][0]              
                                                                 activation_66[0][0]              
                                                                 activation_67[0][0]              
__________________________________________________________________________________________________
conv2d_71 (Conv2D)              (None, None, None, 6 8256        concatenate_17[0][0]             
__________________________________________________________________________________________________
activation_68 (Activation)      (None, None, None, 6 0           conv2d_71[0][0]                  
__________________________________________________________________________________________________
conv2d_72 (Conv2D)              (None, None, None, 3 2080        activation_68[0][0]              
__________________________________________________________________________________________________
conv2d_73 (Conv2D)              (None, None, None, 6 36928       activation_68[0][0]              
__________________________________________________________________________________________________
conv2d_74 (Conv2D)              (None, None, None, 3 51232       activation_68[0][0]              
__________________________________________________________________________________________________
activation_69 (Activation)      (None, None, None, 3 0           conv2d_72[0][0]                  
__________________________________________________________________________________________________
activation_70 (Activation)      (None, None, None, 6 0           conv2d_73[0][0]                  
__________________________________________________________________________________________________
activation_71 (Activation)      (None, None, None, 3 0           conv2d_74[0][0]                  
__________________________________________________________________________________________________
concatenate_18 (Concatenate)    (None, None, None, 1 0           activation_69[0][0]              
                                                                 activation_70[0][0]              
                                                                 activation_71[0][0]              
__________________________________________________________________________________________________
conv2d_75 (Conv2D)              (None, None, None, 6 8256        concatenate_18[0][0]             
__________________________________________________________________________________________________
activation_72 (Activation)      (None, None, None, 6 0           conv2d_75[0][0]                  
__________________________________________________________________________________________________
conv2d_76 (Conv2D)              (None, None, None, 3 2080        activation_72[0][0]              
__________________________________________________________________________________________________
conv2d_77 (Conv2D)              (None, None, None, 6 36928       activation_72[0][0]              
__________________________________________________________________________________________________
conv2d_78 (Conv2D)              (None, None, None, 3 51232       activation_72[0][0]              
__________________________________________________________________________________________________
activation_73 (Activation)      (None, None, None, 3 0           conv2d_76[0][0]                  
__________________________________________________________________________________________________
activation_74 (Activation)      (None, None, None, 6 0           conv2d_77[0][0]                  
__________________________________________________________________________________________________
activation_75 (Activation)      (None, None, None, 3 0           conv2d_78[0][0]                  
__________________________________________________________________________________________________
concatenate_19 (Concatenate)    (None, None, None, 1 0           activation_73[0][0]              
                                                                 activation_74[0][0]              
                                                                 activation_75[0][0]              
__________________________________________________________________________________________________
conv2d_79 (Conv2D)              (None, None, None, 6 8256        concatenate_19[0][0]             
__________________________________________________________________________________________________
activation_76 (Activation)      (None, None, None, 6 0           conv2d_79[0][0]                  
__________________________________________________________________________________________________
conv2d_80 (Conv2D)              (None, None, None, 3 2080        activation_76[0][0]              
__________________________________________________________________________________________________
conv2d_81 (Conv2D)              (None, None, None, 6 36928       activation_76[0][0]              
__________________________________________________________________________________________________
conv2d_82 (Conv2D)              (None, None, None, 3 51232       activation_76[0][0]              
__________________________________________________________________________________________________
activation_77 (Activation)      (None, None, None, 3 0           conv2d_80[0][0]                  
__________________________________________________________________________________________________
activation_78 (Activation)      (None, None, None, 6 0           conv2d_81[0][0]                  
__________________________________________________________________________________________________
activation_79 (Activation)      (None, None, None, 3 0           conv2d_82[0][0]                  
__________________________________________________________________________________________________
concatenate_20 (Concatenate)    (None, None, None, 1 0           activation_77[0][0]              
                                                                 activation_78[0][0]              
                                                                 activation_79[0][0]              
__________________________________________________________________________________________________
conv2d_83 (Conv2D)              (None, None, None, 6 8256        concatenate_20[0][0]             
__________________________________________________________________________________________________
activation_80 (Activation)      (None, None, None, 6 0           conv2d_83[0][0]                  
__________________________________________________________________________________________________
conv2d_84 (Conv2D)              (None, None, None, 1 65          activation_80[0][0]              
__________________________________________________________________________________________________
multiply_2 (Multiply)           (None, None, None, 1 0           subtract_2[0][0]                 
                                                                 conv2d_84[0][0]                  
==================================================================================================
Total params: 807,682
Trainable params: 807,682
Non-trainable params: 0
__________________________________________________________________________________________________
